Of course, if there is no trust to the AD, the groups will not synchronize.
When I try to add a group that does not exist, I get this error.
```
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # freeipa_group.external_group will be created
  + resource "freeipa_group" "external_group" {
      + external = true
      + id       = (known after apply)
      + name     = "ad_test_admins_ext"
      + nonposix = false
    }

  # freeipa_group.internal_group will be created
  + resource "freeipa_group" "internal_group" {
      + external = false
      + id       = (known after apply)
      + name     = "ad_test_admins_int"
      + nonposix = false
    }

  # freeipa_user_group_membership.add_ext_group will be created
  + resource "freeipa_user_group_membership" "add_ext_group" {
      + external_member = "test-ad-group@example.local.corp"
      + id              = (known after apply)
      + name            = (known after apply)
    }

  # freeipa_user_group_membership.add_int_group will be created
  + resource "freeipa_user_group_membership" "add_int_group" {
      + group = (known after apply)
      + id    = (known after apply)
      + name  = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

freeipa_group.external_group: Creating...
freeipa_group.internal_group: Creating...
freeipa_group.external_group: Creation complete after 2s [id=ad_test_admins_ext]
freeipa_group.internal_group: Creation complete after 2s [id=ad_test_admins_int]
freeipa_user_group_membership.add_ext_group: Creating...
freeipa_user_group_membership.add_int_group: Creating...
freeipa_user_group_membership.add_int_group: Creation complete after 1s [id=ad_test_admins_int/g/ad_test_admins_ext]
╷
│ Error: Error creating freeipa the user group membership: map[member:map[group:[{test-ad-group@example.local.corp trusted domain object not found}] idoverrideuser:[] service:[] user:[]]]
│
│   with freeipa_user_group_membership.add_ext_group,
│   on main.tf line 17, in resource "freeipa_user_group_membership" "add_ext_group":
│   17: resource "freeipa_user_group_membership" "add_ext_group" {
│
```